Script started on Sun Jan 22 20:03:02 2017
]0;avansteel@avansteel:~/Projects/CIS452/Lab01[avansteel@avansteel Lab01]$ gdb a.out [2P./a.out gcc -g q6.c [4P./a.out [2@gdb a.out [2P./a.out gcc -g q6.c [5@-Wall -g q6.c [1@ -Wall -g q6.c 
]0;avansteel@avansteel:~/Projects/CIS452/Lab01[avansteel@avansteel Lab01]$ ./a.out 
Hello, world.
You are the 268435456.000000 person to write this program!
]0;avansteel@avansteel:~/Projects/CIS452/Lab01[avansteel@avansteel Lab01]$ gdb.a   a.out 
GNU gdb (GDB) 7.11.1
Copyright (C) 2016 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-pc-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x40054e: file q6.c, line 5.
(gdb) run a.out 
Starting program: /home/avansteel/Projects/CIS452/Lab01/a.out a.out

Breakpoint 1, main () at q6.c:5
5	  double num = 0.0;
(gdb) s
6	  printf("Hello, world.\n");
(gdb) s
Hello, world.
7	  num = pow(2, 28);
(gdb) p
The history is empty.
(gdb) s
8	  printf("You are the %f person to write this program!\n", num);
(gdb) p num
$1 = 268435456
(gdb) quit
A debugging session is active.

	Inferior 1 [process 20456] will be killed.

Quit anyway? (y or n) y
]0;avansteel@avansteel:~/Projects/CIS452/Lab01[avansteel@avansteel Lab01]$ exit

Script done on Sun Jan 22 20:04:57 2017
